#list впорядкована змінна структура данних, індексована
"""A=[1, "text", True, 3.5]"""
#наповнення списку елементами
"""a=[]
n=int(input("Кількість елементів"))
for _ in range(n):
    x=int(input("введи елемент"))
    a.append(x)
print(a)"""
#виведення списку по елементам
"""a=[12,34,34,45]
for i in a:
    print(i)"""
#виведення списку за індексами
"""a=[12,34,34,45]
for i in range(len(a)):
    print(a[i])"""
#індексація
"""a=[12,34,34,45]
print(a[0])
print(a[-1])"""
#зрізи
"""a=[12,34,34,45, 56, 78, 90]
print(a[1:4])
print(a[::3])
print(a[::-1])
"""
#змінна елемента списку
"""a=[12,34,34,45, 56, 78, 90]
a[0]=100
print(a)"""
#додавання елемента
"""a=[12,34,34,45, 56, 78, 90]
a.append(100)
print(a)"""
#видалення елементів
"""a=[12,34,34,45, 56, 78, 90]
a.remove(45)
print(a)"""




